Tekla Open API Reference for Tekla Structures 2025
VertexEnumerator Methods
The VertexEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
VertexEnumerator Class
Tekla.Structures.Solid Namespace